ExampleMessages/DICOM_report01.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Body xmlns:m="http://192.168.163.129/medical_warehouse/warehouse.php">  <m:ingest_file>    <m:clientId>Sam_Test</m:clientId>    <m:md5>81dc9bdb52d04dc20036dbd8313ed055</m:md5>    <m:format>DICOM</m:format>    <m:payload>AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAABESUNNAgAAAFVMBADIAAAAAgABAE9CAAACAAAAAAECAAIAVUkeADEuMi44NDAuMTAwMDguNS4xLjQuMS4xLjg4LjExAAIAAwBVSTQAMS4yLjI3Ni4wLjcyMzAwMTAuMy4xLjQuMTc4NzIwNTQyOC4xNjYuMTExNzQ2MTkyNy4yMAIAEABVSRQAMS4yLjg0MC4xMDAwOC4xLjIuMQACABIAVUkcADEuMi4yNzYuMC43MjMwMDEwLjMuMC4zLjUuMwACABMAU0gQAE9GRklTX0RDTVRLXzM1MyAIABIAREEIADIwMDUwNTMwCAATAFRNBgAxNjA1MjcIABQAVUkcADEuMi4yNzYuMC43MjMwMDEwLjMuMC4zLjUuMwAIABYAVUkeADEuMi44NDAuMTAwMDguNS4xLjQuMS4xLjg4LjExAAgAGABVSTQAMS4yLjI3Ni4wLjcyMzAwMTAuMy4xLjQuMTc4NzIwNTQyOC4xNjYuMTExNzQ2MTkyNy4yMAgAIABEQQAACAAjAERBCAAyMDA1MDUzMAgAMABUTQAACAAzAFRNBgAxNjA1MjcIAFAAU0gAAAgAYABDUwIAU1IIAHAATE8AAAgAkABQThwARnVrdWRhXkthdGhlcmluZSBNLl5eXk0uIEQuIAgAEAFTUQAA//////7/AOD/////CAACAVNIDgA5OV9PRkZJU19EQ01USwgADAFVSRoAMS4yLjI3Ni4wLjcyMzAwMTAuMy4wLjAuMQAIABUBU1QaAE9GRklTIERDTVRLIENvZGluZyBTY2hlbWUgCAAWAVNUPABLdXJhdG9yaXVtIE9GRklTIGUuVi4sIEVzY2hlcndlZyAyLCAyNjEyMSBPbGRlbmJ1cmcsIEdlcm1hbnn+/w3gAAAAAP7/3eAAAAAACAAwEExPIgBPRkZJUyBTdHJ1Y3R1cmVkIFJlcG9ydGluZyBTYW1wbGVzCAA+EExPEgBCYXNpYyBUZXh0IFJlcG9ydCAIABERU1EAAP/////+/93gAAAAABAAEABQThQAT3N0ZXJtYW5eUGhpbGxpcF5CLiAQACAATE8AABAAMABEQQgAMTkyMjA5MDkQAEAAQ1MCAE0gIAANAFVJNAAxLjIuMjc2LjAuNzIzMDAxMC4zLjEuMi4xNzg3MjA1NDI4LjE2Ni4xMTE3NDYxOTI3LjIxIAAOAFVJNAAxLjIuMjc2LjAuNzIzMDAxMC4zLjEuMy4xNzg3MjA1NDI4LjE2Ni4xMTE3NDYxOTI3LjIyIAAQAFNIAAAgABEASVMCADEgIAATAElTAgAxIEAAQKBDUwoAQ09OVEFJTkVSIEAAQ6BTUQAA//////7/AOD/////CAAAAVNIBgBEVC4wNiAIAAIBU0gOADk5X09GRklTX0RDTVRLCAAEAUxPFABDb25zdWx0YXRpb24gUmVwb3J0IP7/DeAAAAAA/v/d4AAAAABAAFCgQ1MIAFNFUEFSQVRFQAByo1NRAAD//////v/d4AAAAABAAJGkQ1MIAFBBUlRJQUwgQACTpENTCgBVTlZFUklGSUVEQAAwp1NRAAD//////v8A4P////9AABCgQ1MQAEhBUyBPQlMgQ09OVEVYVCBAAECgQ1MGAFBOQU1FIEAAQ6BTUQAA//////7/AOD/////CAAAAVNIBgBJSEUuMDQIAAIBU0gOADk5X09GRklTX0RDTVRLCAAEAUxPDgBPYnNlcnZlciBOYW1lIP7/DeAAAAAA/v/d4AAAAABAACOhUE4YAFBhY2tlcl5EYXZpZCBNLl5eXk0uIEQuIP7/DeAAAAAA/v8A4P////9AABCgQ1MQAEhBUyBPQlMgQ09OVEVYVCBAAECgQ1MEAFRFWFRAAEOgU1EAAP/////+/wDg/////wgAAAFTSAYASUhFLjA1CAACAVNIDgA5OV9PRkZJU19EQ01USwgABAFMTxoAT2JzZXJ2ZXIgT3JnYW5pemF0aW9uIE5hbWX+/w3gAAAAAP7/3eAAAAAAQABgoVVUAAAQAAAAUmVkbGFuZHMgQ2xpbmljIP7/DeAAAAAA/v8A4P////9AABCgQ1MIAENPTlRBSU5TQABAoENTBABURVhUQABDoFNRAAD//////v8A4P////8IAAABU0gIAENPREVfMDEgCAACAVNIDgA5OV9PRkZJU19EQ01USwgABAFMTwwARGVzY3JpcHRpb24g/v8N4AAAAAD+/93gAAAAAEAAYKFVVAAADgQAAFRoaXMgNzgteWVhci1vbGQgZ2VudGxlbWFuIHJlZmVycmVkIGJ5IERyLiBGdWt1ZGEgd2FzIGFsc28gc2VlbiBieSBEci4gTWFzb24gYXQgdGhlIFJlZGxhbmRzIENsaW5pYy4gSGUgaGFzIGJlZW4gc2VlbiBpbiB0aGUgcGFzdCBieSBEci4gS2x1Z21hbi4KVGhlIHBhdGllbnQgZGV2ZWxvcGVkIGEgbGVzaW9uIGluIHRoZSBjb25jaGEgb2YgdGhlIGxlZnQgZXh0ZXJuYWwgZWFyLiBSZWNlbnQgYmlvcHN5IGNvbmZpcm1lZCB0aGlzIGFzIGJlaW5nIGEgc3F1YW1vdXMgY2VsbCBjYXJjaW5vbWEuIFRoZSBwYXRpZW50IGhhcyBoYWQgYSBmZXcgb3RoZXIgc2tpbiBjYW5jZXJzLgpPZiBtb3N0IHNpZ25pZmljYW50IHBhc3QgaGlzdG9yeSBpcyB0aGUgZmFjdCB0aGF0IHRoaXMgcGF0aWVudCBoYXMgYSBsZXVrZW1pYSB0aGF0IGhhcyBiZWVuIHRyZWF0ZWQgaW4gc3RhbmRhcmQgZmFzaGlvbiBieSBEci4gS2x1Z21hbi4gVGhlIHBhdGllbnQgd2FzIHRoZW4gdHJhbnNmZXJyZWQgdG8gdGhlIFJlZGxhbmRzIENsaW5pYyBhbmQgYnkgc29tZSBleHBlcmltZW50YWwgcHJvdG9jb2wgd2hpY2gsIEkgZ3Vlc3MsIGluY2x1ZGVzIHNvbWUgc29ydCBvZiBseW1waG9jeXRlIGVsZWN0cm9waG9yZXNpcywgaGFzIGJlZW4gcGxhY2VkIGludG8gcmVtaXNzaW9uLiBIZSBpcyBub3QgY3VycmVudGx5IG9uIGFueSBhbnRpbGV1a2VtaWEgZHJ1Z3MgYW5kIGhhcyByZXNwb25kZWQgZXh0cmVtZWx5IHdlbGwgdG8gaGlzIG1lZGljYWwgbWFuYWdlbWVudC4KT24gZXhhbWluYXRpb24sIHRoZSBwYXRpZW50IGlzIGhlYWx0aHkgaW4gZ2VuZXJhbCBhcHBlYXJhbmNlLiBUaGVyZSBpcyBhIDEuNSBjbSBsZXNpb24gb24gdGhlIGNvbmNoYSBvZiB0aGUgZWFyLCB3aGljaCBpcyBzZWVuIHdlbGwgb24gcGhvdG9ncmFwaCBvZiB0aGUgbGVmdCBleHRlcm5hbCBlYXIuIFRoZXJlIGFyZSBudW1lcm91cyBzb2Z0IGx5bXBoIG5vZGVzIGluIGJvdGggc2lkZXMgb2YgdGhlIG5lY2ssIHdoaWNoIEkgcHJlc3VtZSBhcmUgcmVsYXRlZCB0byBoaXMgbGV1a2VtaWEuIP7/DeAAAAAA/v8A4P////9AABCgQ1MIAENPTlRBSU5TQABAoENTBABURVhUQABDoFNRAAD//////v8A4P////8IAAABU0gIAENPREVfMDIgCAACAVNIDgA5OV9PRkZJU19EQ01USwgABAFMTwoARGlhZ25vc2lzIP7/DeAAAAAA/v/d4AAAAABAAGChVVQAAJgAAABTcXVhbW91cyBjZWxsIGNhcmNpbm9tYSwgcmVsYXRpdmVseSBzdXBlcmZpY2lhbCwgaW52b2x2aW5nIHRoZSBza2luIG9mIHRoZSBsZWZ0IGV4dGVybmFsIGVhciwgd2hpY2ggaXMgc2VlbiB3ZWxsIG9uIHBob3RvZ3JhcGggb2YgdGhlIGxlZnQgZXh0ZXJuYWwgZWFyLv7/DeAAAAAA/v8A4P////9AABCgQ1MIAENPTlRBSU5TQABAoENTBABURVhUQABDoFNRAAD//////v8A4P////8IAAABU0gIAENPREVfMDMgCAACAVNIDgA5OV9PRkZJU19EQ01USwgABAFMTwoAVHJlYXRtZW50IP7/DeAAAAAA/v/d4AAAAABAAGChVVQAAAwBAABUaGUgcGxhbiBvZiB0cmVhdG1lbnQgaXMgYXMgZm9sbG93czogNDUwMCByYWQsIDE1IHRyZWF0bWVudCBzZXNzaW9ucywgdXNpbmcgMTAwIGtWIHJhZGlhdGlvbi4KVGhlIHJlYXNvbiBmb3IgdHJlYXRtZW50LCBleHBlY3RlZCBhY3V0ZSByZWFjdGlvbiwgYW5kIHJlbW90ZSBwb3NzaWJpbGl0eSBvZiBjb21wbGljYXRpb24gd2FzIGRpc2N1c3NlZCB3aXRoIHRoaXMgcGF0aWVudCBhdCBzb21lIGxlbmd0aCwgYW5kIGhlIGFjY2VwdGVkIHRoZXJhcHkgYXMgb3V0bGluZWQu/v8N4AAAAAD+/93gAAAAAA==</m:payload>  </m:ingest_file></soap:Body></soap:Envelope>